Revit 2027 API
StairsRun.EndsWithRiser Property
 True if the stairs run ends with a riser, false otherwise.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool EndsWithRiser { get; set; }
Public Property EndsWithRiser As Boolean
	Get
	Set
public:
property bool EndsWithRiser {
	bool get ();
	void set (bool value);
}
member EndsWithRiser : bool with get, set
Property Value
Boolean
Remarks
 If selected, Revit adds a riser to the end of the run. Clearing this option will change the number of risers in the run. You will need to manually add or remove risers to maintain the original height.
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace